uhnp/src/InformationRegisters/НастройкаЗаменыНоменклатуры/НастройкаЗаменыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаЗаменыНоменклатуры</name>
  <resources>
    <name>Коэффициент</name>
    <comment>Если количество в единицах источника умножить на коэффициент, то получим количество в единицах приемника</comment>
    <type>
      <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
    </type>
  </resources>
  <dimensions>
    <name>СпособЗамены</name>
    <type>
      <types>EnumRef.СпособыЗаменыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураИсточник</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаИсточник</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияИсточник</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПриемник</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПриемник</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияПриемник</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/СпособыЗаменыНоменклатуры/СпособыЗаменыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыЗаменыНоменклатуры</name>
  <enumValues>
    <name>ПересчетЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>Унификат</name>
  </enumValues>
  <enumValues>
    <name>Аналоги</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/НастройкаЗаменыНоменклатуры/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Замещение = Истина ИЛИ ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// 
	ТаблицаДвижений = ЭтотОбъект.Выгрузить(, "СпособЗамены, НоменклатураИсточник, ХарактеристикаИсточник, ЕдиницаИзмеренияИсточник, НоменклатураПриемник, ХарактеристикаПриемник, ЕдиницаИзмеренияПриемник, Коэффициент");
	ТаблицаУнификатов = ТаблицаДвижений.Скопировать(ТаблицаДвижений.НайтиСтроки(Новый Структура("СпособЗамены", Перечисления.СпособыЗаменыНоменклатуры.Унификат)));
	
	ТаблицаПересчетов = ТаблицаДвижений.Скопировать(ТаблицаДвижений.НайтиСтроки(Новый Структура("СпособЗамены", Перечисления.СпособыЗаменыНоменклатуры.ПересчетЕдиницыИзмерения)));
	
	Если ТаблицаУнификатов.Количество() > 0 Тогда
		
		ОбработатьЗаписиУнификаты(ТаблицаУнификатов);
		
	КонецЕсли;
	
	Если ТаблицаПересчетов.Количество() > 0 Тогда
		
		ОбработатьЗаписиПересчет(ТаблицаПересчетов);
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработатьЗаписиУнификаты(ТаблицаУнификатов)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ОбщегоНазначенияУХ.ЗагрузитьТаблицуВоВременнуюТаблицуЗапроса(Запрос, "ВТ_ДанныеНабораЗаписи", ТаблицаУнификатов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкаЗаменыНоменклатуры.СпособЗамены КАК СпособЗамены,
	|	НастройкаЗаменыНоменклатуры.НоменклатураИсточник КАК НоменклатураИсточник,
	|	НастройкаЗаменыНоменклатуры.ХарактеристикаИсточник КАК ХарактеристикаИсточник,
	|	НастройкаЗаменыНоменклатуры.ЕдиницаИзмеренияИсточник КАК ЕдиницаИзмеренияИсточник,
	|	СУММА(1) КАК КолвоЗаписей
	|ИЗ
	|	РегистрСведений.НастройкаЗаменыНоменклатуры КАК НастройкаЗаменыНоменклатуры
	|ГДЕ
	|	(НастройкаЗаменыНоменклатуры.СпособЗамены, НастройкаЗаменыНоменклатуры.НоменклатураИсточник, НастройкаЗаменыНоменклатуры.ХарактеристикаИсточник, НастройкаЗаменыНоменклатуры.ЕдиницаИзмеренияИсточник) В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеНабораЗаписи.СпособЗамены КАК СпособЗамены,
	|				ВТ_ДанныеНабораЗаписи.НоменклатураИсточник КАК НоменклатураИсточник,
	|				ВТ_ДанныеНабораЗаписи.ХарактеристикаИсточник КАК ХарактеристикаИсточник,
	|				ВТ_ДанныеНабораЗаписи.ЕдиницаИзмеренияИсточник КАК ЕдиницаИзмеренияИсточник
	|			ИЗ
	|				ВТ_ДанныеНабораЗаписи КАК ВТ_ДанныеНабораЗаписи)
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкаЗаменыНоменклатуры.СпособЗамены,
	|	НастройкаЗаменыНоменклатуры.НоменклатураИсточник,
	|	НастройкаЗаменыНоменклатуры.ХарактеристикаИсточник,
	|	НастройкаЗаменыНоменклатуры.ЕдиницаИзмеренияИсточник
	|
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выб = Результат.Выбрать();
	
	Если Выб.Количество() > 0 Тогда
		
		ВызватьИсключение НСтр("ru='Нельзя завести несколько унификатов одной номенклатуры/товарной категории!'");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьЗаписиПересчет(ТаблицаПересчетов)
	
	Для Каждого СтрокаПересчет Из ТаблицаПересчетов Цикл
		
		// Дописываем обратные пересчеты к тем, которые в таблице
		нз = РегистрыСведений.НастройкаЗаменыНоменклатуры.СоздатьНаборЗаписей();
		
		нз.Отбор.СпособЗамены.Установить(СтрокаПересчет.СпособЗамены);
		нз.Отбор.НоменклатураИсточник.Установить(СтрокаПересчет.НоменклатураПриемник);
		нз.Отбор.ХарактеристикаИсточник.Установить(СтрокаПересчет.ХарактеристикаПриемник);
		нз.Отбор.ЕдиницаИзмеренияИсточник.Установить(СтрокаПересчет.ЕдиницаИзмеренияПриемник);
		нз.Отбор.НоменклатураПриемник.Установить(СтрокаПересчет.НоменклатураИсточник);
		нз.Отбор.ХарактеристикаПриемник.Установить(СтрокаПересчет.ХарактеристикаИсточник);
		нз.Отбор.ЕдиницаИзмеренияПриемник.Установить(СтрокаПересчет.ЕдиницаИзмеренияИсточник);
		
		дв = нз.Добавить();
		дв.СпособЗамены = СтрокаПересчет.СпособЗамены;
		дв.НоменклатураИсточник = СтрокаПересчет.НоменклатураПриемник;
		дв.ХарактеристикаИсточник = СтрокаПересчет.ХарактеристикаПриемник;
		дв.ЕдиницаИзмеренияИсточник = СтрокаПересчет.ЕдиницаИзмеренияПриемник;
		дв.НоменклатураПриемник = СтрокаПересчет.НоменклатураИсточник;
		дв.ХарактеристикаПриемник = СтрокаПересчет.ХарактеристикаИсточник;
		дв.ЕдиницаИзмеренияПриемник = СтрокаПересчет.ЕдиницаИзмеренияИсточник;
		дв.Коэффициент = 1 / СтрокаПересчет.Коэффициент;
		
		нз.ОбменДанными.Загрузка = Истина;
		
		нз.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();
	Для каждого ЗаписьЗамены Из ЭтотОбъект Цикл    
		
		ИспользоватьХарактеристикиИсточник = ОпределитьХарактеристикиИспользуются(
												ЗаписьЗамены.НоменклатураИсточник);
		ИспользоватьХарактеристикиПриемник = ОпределитьХарактеристикиИспользуются(
												ЗаписьЗамены.НоменклатураПриемник);
												
		Если Не ИспользоватьХарактеристикиИсточник Тогда
			НепроверяемыеРеквизиты.Добавить("ХарактеристикаИсточник"); 
			Отказ = Истина;  
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить характеристику источника'"));
		КонецЕсли;     
		
		Если Не ИспользоватьХарактеристикиИсточник Тогда
			НепроверяемыеРеквизиты.Добавить("ХарактеристикаПриемник"); 
			Отказ = Истина;  
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить характеристику приемника'"));
		КонецЕсли;

	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты); 
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции
Функция ОпределитьХарактеристикиИспользуются(Номенклатура)
	Возврат	УправлениеЗакупкамиВстраиваниеПереопределяемыйУХ.ХарактеристикиИспользуются(Номенклатура);
КонецФункции
#КонецОбласти 

#КонецЕсли
